---
kind: other
id: Properties.T:Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs
source: html/5affcd0d-0cb7-aa15-9c2d-de5c8a868caf.htm
---
# TaskDialogShowingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.